$(document).ready(function(){
    var touch = $('#touchMenu'),
    menu = $('#menu'), line_b=$('.line-b'),
    h_t=$(".item-participants").position().top,// позиція верха
    h_b=$('#competition').position().top;
    $(".menu-s").on("click","a", function (event) {
        event.preventDefault();
        var id  = $(this).attr('href'),
            top = $(id).offset().top ;
        $('#line-2').removeClass("close");
        line_b.removeClass("cmn-toggle-switch_3 cmn-toggle-switch_1 cmn-toggle-switch_close line-b-close");
        $('body,html').animate({scrollTop: (top - 40) }, 1500);
    });
    //read competition
    $('#read-competition').on('click', function () {
        $("#close_t").toggleClass('close');
        $('#continuation').toggleClass('close');
        $('#arrow').toggleClass('arrow-r');
        $('#read').toggleClass('close');
        $('body,html').animate({scrollTop: $("#competition").offset().top - 100}, 500);
    });
    $(touch).on('click', function(e){
        if( !$('#line-2').hasClass('close')){
            line_b.addClass("cmn-toggle-switch_close");
            line_b.addClass('line-b-close');
            $('#line-2').addClass('close');
            $('#line-3').addClass("cmn-toggle-switch_3");
            $('#line-1').addClass("cmn-toggle-switch_1");
        }
        else {
            $('#line-2').removeClass("close");
            line_b.removeClass("cmn-toggle-switch_3 cmn-toggle-switch_1 cmn-toggle-switch_close line-b-close")
        }
        e.preventDefault();
        menu.slideToggle();
    });
    $("#menu a").on('click', function(e) {
        var wid = $(window).width();
        if(wid < 800 ) {
            e.preventDefault();
            menu.slideToggle();
        }
    });
    $(window).scroll(function(){
        var winScrollTop = $(this).scrollTop();
        if(winScrollTop < h_t + 50){
            (function (){
                windo.css("top", h_t);
            })();
        }
        if((winScrollTop+w_h) >(h_b-20)){
            (function (){
                windo.css("top", (h_b-w_h));
            })();
        }
        if((winScrollTop+hed_h+50)>h_t && (winScrollTop + 50) <h_b-w_h-50){
            (function (){
                windo.css("top", (winScrollTop+hed_h+50));
            })();
        }
    });
});
var Name=["Анастасія Похил","Поліна Єременко","Юлія Ємець",'Наталія Швець',"Таміла Поліщук", "Олександра Поліщук","Анастасія Скоченко","Інна Сокирка","Анастасія Рибак","Діана Камінська","Дайана Лонська","Анна Гиря"];
var faculty=["№1Д-17, відділення \"Дизайну\".","№1Т-16, відділення \"Підприємництва та маркетингу\".","№1Д-16, відділення \"Дизайну».","№1Ф-16, відділення «Обліку та фінансів\".",'№1Ф-15, відділення "Фінанси та кредит".',
    '№1Д-16, відділення «Дизайну».','№1Е-16 відділення "Економіки".','№1М-16, відділення "Підприємництва та маркетингу"','№1Д-16, відділення "Дизайну".','№1Ф-16, відділення "Обліку та фінансів"','№ 1Т-17, відділення "Підприємництва та маркетингу"','№1Ф-16, відділення "Обліку та фінансів"'];
var text=['Володарка гран-прі Всеукраїнського художнього конкурсу "Я - чарівник", стипендіатка міського голови у 2016-2017 навчальному році, неодноразова призерка обласних та лауреат всеукраїнських творчих конкурсів. Захоплюється живописом та змішаними видами єдиноборств (ММА). Цілеспрямована, мрійлива. Особисте кредо: "Мрії обов\'язково збудуться, тільки треба докласти зусиль".',
'Дівчина - феєрверк, яка наповнена суцільним позитивом і безмежною радістю. Поліна не уявляє свого життя без рідних та друзів. З самого дитинства співає, 6 років присвятила грі на гітарі, з недавнього часу захоплюється танцями, тому активно займається Pole-денсом.',
    'Ще з початкової школи займається музикою, без неї не уявляє свого життя. Активно розвивається в модельній сфері. Участь у показах та конкурсах краси приносить дівчині неабияке задоволення. Фіналістка конкурсу «СтудМіс Черкащина-2017». Учасниця конкурсу "Міс Незалежність" ТРЦ Любава. В майбутньому планує закінчити модельну школу й стати професійною моделлю.',
    'Займається спортом, зокрема входить до збірної команди коледжу з баскетболу. Активна та творча особистість. Вона знає, чого хоче, і робить все можливе для здійснення своїх мрій.,',
    'Дуже позитивна дівчина, обожнює нові знайомства, має багато хобі, творча натура. Завжди любить відкривати щось нове, у дитинстві займалася декоративно-прикладним мистецтвом, танцями та малюнком, нині опановує гру на гітарі, техніку малюнку хною та різні елементи фігурного катання на роликах. Мріє знайти себе та довести, що фінансисти не лише розумні, а й красиві. Докладає максимум зусиль, щоб здобути титул "Міс ЧДБК 2018".',
    'Мила, сонячна та загадкова дівчина-дизайнер. Кожного ранку прокидається із планом дій, адже веде активний спосіб життя. Має трішки наївне бачення світу, але саме так і черпає натхнення. Любить цікаві профілі в Instаgram, гарну музику, запах дощу та шурхіт олівця по паперу.',
    'Дівчина - оптиміст, ніколи не зациклюється на проблемах та невдачах, вперто йде до поставленої мети. Креатив – її друге ім’я. Обожнює готувати, займається вирощуванням квітів та не уявляє свого життя без живого спілкування. Формула щастя для Анастасії – насолоджуйся життям і будь у постійному русі.',
    'Має наполегливий характер, який у всьому їй допомагає. Завдяки своїй активності стала старостою групи. Інна яскрава та енергійна, не любить бути непомітною, тому часто буває ведучою на святах у коледжі. Віддає перевагу активному способу життя, займається танцями. По життю крокує з девізом: "Усе в наших руках – саме тому їх не можна опускати".',
    'Все її життя – це творчість, з якою вона не розлучається й на хвилинку. Як у своїх роботах, так і у житті завжди прагне досконалості. Свій вільний час любить проводити за читанням книг, адже вони розвивають уяву та фантазію.',
    'Дівчина з характером. Вважає себе меломаном та кіноманом. Регулярно відвідує спортзал. Входить до збірної команди коледжу з баскетболу, хоча й залишається мініатюрною.',
    'Енергійна, гарна та впевнена у собі дівчина. Окрім навчання, займається танцями, на думку близьких гарно співає. В конкурсі «Міс ЧДБК-2018» налаштована на перемогу та готова докласти максимальних зусиль, аби довести, що найкраща.',
    'Активістка Студентської ради, у подальшому житті бачить себе професійною спортсменкою. На сьогоднішній день має титул Чемпіонки Світу з панкратіону та є багаторазовою Чемпіонкою України. Але на цьому Анна не зупиняється, не уявляє подальшого розвитку без самовдосконалення. Саме через цю рису бере участь у «Міс ЧДБК-2018», адже навіть професійні спортсменки полюбляють підбори та сукні.',
];
var r=0,w_h=0, hed_h=$('header').height(), sl = $('#start'), windo=$('#windows');
function start(n) {
    $('#sl-img').attr("src","img/"+n+".jpg");
    r=n;
    n-=1;
    $('#name').text(Name[n]+",");
    $('#facultat').text('студентка групи '+faculty[n]);
    $('#text').text(text[n]);
    w_h=$('#windows').height();
}
function windows(n) {
    windo.removeClass('close');
    start(n);
    // $('body,html').animate({scrollTop: (windo.offset().top - 100)}, 500);
}
function exit() {
    windo.addClass('close')
}
function Next() {
    sl.addClass('left-w opacity_0');
    setTimeout(function(){
        sl.removeClass('left-w');
        sl.addClass('right-w');

        if(r!=12) {
            start(r + 1);
        }
        else {
            start(1)
        }
    },350);
    setTimeout(function () {
        sl.removeClass('opacity_0 right-w')
    },800)
}
function left() {
    sl.addClass('right-w opacity_0');
    setTimeout(function(){
        sl.removeClass('right-w');
        sl.addClass('left-w');
        if(r!=1) {
            start(r-1);
        }
        else {
            start(12)
        }
    },350);
    setTimeout(function () {
        sl.removeClass('opacity_0 left-w')
    },800)
}
